n1 = int(input('Введи число: '))
n2 = int(input('Введи число: '))


print(f'{n1} + {n2} = {n1 + n2};')  # f-строчка позволяет вставить значение переменной в строку
print(f'{n1} - {n2} = {n1 - n2};')
print(f'{n1} * {n2} = {n1 * n2};')
print(f'{n1} ** {n2} = {n1 ** n2};')
print(f'{n1} / {n2} = {n1 / n2}, округлим: {round(n1 / n2, 3)};')  # round() - округление чисел
# round помимо числа для округления может получить второе число, которое управляет
# количеством знаков после десятичной точки
print(f'{n1} // {n2} = {n1 // n2};')
print(f'{n1} % {n2} = {n1 % n2};')


