# Дано положительное действительное число Х. Выведите его дробную часть.
x = 2.2431
print(x - int(x))
print(x % 1)

